tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/command-not-found"
tap "homebrew/cask-drivers"

# Core Programs

cask "firefox"
cask "google-chrome"
cask "telegram"
cask "spotify"

cask "vlc"

cask "notion"

cask "cleanmymac"
cask "omnidisksweeper"

# Cloud Storage

cask "google-backup-and-sync"
cask "google-drive"

# I/O Control

cask "logitech-options"
tap "jakehilborn/jakehilborn"
brew "displayplacer"
cask "monitorcontrol"

# Entertainment

cask "steam"
cask "discord"
cask "teamspeak-client"
cask "battle-net"

# Terminal & Shell & Basic Utilities

cask "iterm2"
brew "zsh"
brew "zsh-syntax-highlighting"

brew "coreutils"
brew "git"
brew "gnu-typist"

brew "httpie"
brew "unrar"
brew "fd"
brew "tldr"
brew "hr"
brew "terminal-notifier"
brew "direnv"
brew "jq"
cask "bwana"

brew "tmux"
brew "tmuxinator"

brew "lftp"

# Development

## Development: Java & Scala

cask "adoptopenjdk"
cask "adoptopenjdk8"
brew "jenv"
brew "scala"
brew "sbt"

## Development: NodeJS

brew "node"
# Note: See `which nvm`
brew "nvm"
brew "yarn"

## Development: Miscellaneous Programming Language

brew "ruby"
brew "mit-scheme"

brew "ghc"
brew "haskell-stack"

### will setup `rustup`, which will setup `rustc`, `rustfmt`, etc.
brew "rustup-init"

brew "erlang"

brew "go"

## Development: IDE

### cask "intellij-idea-ce" # latest version will fucked up your development
cask "visual-studio-code"
cask "lens"

## Development: API Testing Tools

cask "paw"
cask "postman"

## Development: Database

brew "postgresql", restart_service: true
brew "postgresql@9.6", restart_service: true
cask "tableplus"
cask "pgadmin4"

## Containerization

cask "docker"
brew "helm"
brew "minikube"

## Development: CI/CD

brew "jenkins"
brew "fastlane"

## Development: Cloud Platform

tap "heroku/brew"
brew "heroku"
brew "heroku-node"

cask "google-cloud-sdk"

# Development: Miscellaneous

# ngrok: secure introspectable tunnels to localhost

brew "memcached"
cask "rabbitmq"
cask "ngrok"
